/* Это объявление переменной, мы наши кнопку по тегу */
const button = document.querySelector('button');

/* Тут на кнопку навешиваем обрабочик, который ждёт клика и тогда запустит логику */
button.addEventListener('click', function() {
	alert('Храбрый монтажник без пояса ходит - Минус один человек на заводе :(')
	alert('Беспечный рабочий шкафчик открыл, На знак "напряжение" глазки закрыл, Вдруг глазки взлетели под потолок, Обугленный трупик, в шкафчике - ток :(')
	alert('Транспортный жёлоб, расплавлен металл, - Я перепрыгну, - рабочий сказал. Долго искали в канаве скелет, Сгинул бесследно легкоатлет:(')


})